app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `emp_id` = 'Admin'
 LIMIT 1
---
    public function loginUser()
    {

        // checking user creantial
        $emp_id = $this->request->getPost('emp_id');
        $password = $this->request->getPost('password');


        $userModel = new UserModel();

        if ($userModel->where('emp_id', $emp_id)->first()) {
            $userInfo = $userModel->where('emp_id', $emp_id)->first();

SELECT *
FROM `employees`
WHERE `official_mail` = 'magendiran.m@gighz.net'
 LIMIT 1
---
    public function send_otp()
    {
        $employeeModel = new EmployeeModel;
        $otpModel = new OtpModel;
        $email = $this->request->getPost('mail');
        $otp = random_int(100000, 999999);
        $expiry = time();
        $query = $otpModel->where('email', $email)->first();

        // echo $querys['name'];
        if ($employeeModel->where('official_mail', $email)->first()) {