app/Controllers/Dashboard.php

    public function baseDatas()
    {
        $session = session();
        $data['name'] = $session->get('name');
        $data['role'] = $session->get('role');
        $data['emp_id'] = $session->get('emp_id');
---
SELECT user_name FROM `role` WHERE id='3'
SELECT user_name FROM `role` WHERE id='1'