app/Controllers/Dashboard.php

SELECT user_name FROM `role` WHERE id='3'
---
    public function baseDatas()
    {
        $session = session();
        $data['name'] = $session->get('name');
        $data['role'] = $session->get('role');