app/Controllers/EmployeeController.php

    public function leaveApplySubmit()
    {
        $session = \Config\Services::session();
        $emp_id = $session->get('emp_id');
        $name = $session->get('name');
        $leaveType = $this->request->getPost('leaveType');
        $startDate = $this->request->getPost('leave_start_date');
        $endDate = $this->request->getPost('leave_end_date');
        $reason = $this->request->getPost('leave_reason');

        $EmployeeModel = new EmployeeModel;
        $emp_data = $EmployeeModel->find($emp_id);
---
SELECT *
FROM `employees`
WHERE `employees`.`emp_id` = 'GZ44'


        if ($startDate <= $endDate) {
            $saveLeaveRequest = new LeaveRquestModel();
            $query = $saveLeaveRequest->insert($data);
---
INSERT INTO `leave_request` (`emp_id`, `leave_type`, `start_date`, `end_date`, `reason`, `total_num_leaves`, `balence_leave`, `hold_balence_leave`) VALUES ('GZ44', 'emergency leave', '2025-09-25', '2025-09-25', 'went to hospitel ', 1, '6', '6')