app/Controllers/HRController.php

SELECT *
FROM `employees`
---

        $currentYear = date('Y');

        $staffs = $EmployeeModel->findAll();

SELECT *
FROM `company_holiday`
---
    public function calculateLeaveDays(\DateTime $start, \DateTime $end)
    {
        //fetch company holidays
        $companyHolidays = new CompanyHolidayModel();
        $holiday = $companyHolidays->findAll();