app/Models/AttendanceLogModel.php

    public function getPunchLogs($userId, $date)
    {

        log_message('debug', "User ID: {$userId}, Date: {$date}");
        return $this->db->table('attendance_logs')
            ->select("TIME_FORMAT(timestamp, '%H:%i') as time, id")  // Extract only the time part
            ->Where('employee_id', $userId)
            ->where('DATE(timestamp)', $date)  // Ensure date matches
            ->orderBy('time', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT TIME_FORMAT(timestamp, '%H:%i') as time, `id`
FROM `attendance_logs`
WHERE `employee_id` = '23'
AND DATE(timestamp) = '2025-09-14'
ORDER BY `time` ASC