app/Models/AttendanceModel.php

    public function getEmployeesLeaves($empId, $selectedMonth = null, $selectedYear = null)
    {
        $compensationModel = new CompensationModel;
        $comapnyHolidayModel = new CompanyHolidayModel;
        $leaveRequest = new LeaveRquestModel();
        $comapnyHolidayModel = new CompanyHolidayModel;

        $dates = $this->getStartAndEndDate($selectedMonth, $selectedYear);
        $startDate = $dates['startDate'];
        $endDate = $dates['endDate'];


        $query = $this->db->table('attendance')
            ->select('attendance.user_id, date, total_hours,work_status, attendance_users.name, attendance_users.emp_id,
                employees.dept, employees.leave_grade')
            ->join('attendance_users', 'attendance_users.user_id = attendance.user_id')
            ->join('employees', 'employees.emp_id = attendance_users.emp_id')
            // ->join('leave_request', 'leave_request.emp_id = attendance_users.emp_id')
            ->orderBy('employees.dept', 'ASC')
            ->where('employees.emp_id', $empId)
            ->where('date >=', $startDate)
            ->where('date <=', $endDate)
            ->orderBy('date', 'ASC')
            ->get();
---
SELECT `attendance`.`user_id`, `date`, `total_hours`, `work_status`, `attendance_users`.`name`, `attendance_users`.`emp_id`, `employees`.`dept`, `employees`.`leave_grade`
FROM `attendance`
JOIN `attendance_users` ON `attendance_users`.`user_id` = `attendance`.`user_id`
JOIN `employees` ON `employees`.`emp_id` = `attendance_users`.`emp_id`
WHERE `employees`.`emp_id` = 'GZ44'
AND `date` >= '2025-8-25'
AND `date` <= '2025-9-24'
ORDER BY `employees`.`dept` ASC, `date` ASC