app/Models/CompanyHolidayModel.php

SELECT `holiday_date`
FROM `company_holiday`
WHERE `holiday_type` = 'other_saturday'
---
    public function getOtherSaturdays()
    {
        return $this->db->table($this->table)
            ->select('holiday_date')
            ->where('holiday_type', 'other_saturday')
            ->get()
            ->getResultArray();