app/Models/CompensationModel.php

    public function getAllCompensationrequest2()
    {
        $builder = $this->db->table($this->table);
        $builder->select('compensation_request.*')
        // Filter: Dates between 10 days before and 24 days after today
                ->where('YEAR(compensation_request.start_date)',date('Y'));

        $pending = $this->where('status','pending')->countAllResults();
        // $pending = $this->where('leave_request.start_date >= DATE_SUB(CURDATE(), INTERVAL 15 DAY)')
        //     ->where('leave_request.start_date <= DATE_ADD(CURDATE(), INTERVAL 30 DAY)')
        //     ->where('status','pending')->countAllResults();
        $data=[
            'count' => $builder->countAllResults(),
            'pending' => $pending
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `compensation_request`
WHERE `start_date` >= '2025-07-28'
AND `status` = 'pending'